src/Catalogs/РолиОборудования/РолиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиОборудования</name>
  <predefined>
    <items>
      <name>Apache</name>
      <description>Apache</description>
    </items>
    <items>
      <name>СерверIIS</name>
      <description>IIS</description>
    </items>
    <items>
      <name>СерверMSSQL</name>
      <description>MS SQL</description>
    </items>
    <items>
      <name>СерверPostgreSQL</name>
      <description>PostgreSQL</description>
    </items>
    <items>
      <name>ВиртуальнаяМашинаVMware</name>
      <description>Виртуальная машина VMware</description>
    </items>
    <items>
      <name>ВнешнийРесурс</name>
      <description>Внешний ресурс</description>
    </items>
    <items>
      <name>РабочийСервер1С</name>
      <description>Рабочий сервер 1С</description>
    </items>
    <items>
      <name>Сервер1СиMSSQL</name>
      <description>Сервер &quot;1С и MS SQL&quot;</description>
    </items>
    <items>
      <name>Сервер1СиPostgreSQL</name>
      <description>Сервер &quot;1С и PostgreSQL&quot;</description>
    </items>
    <items>
      <name>Сервер1СПредприятие</name>
      <description>Сервер &quot;1С:Предприятие&quot;</description>
    </items>
    <items>
      <name>СерверWindows</name>
      <description>Сервер c ОС Windows</description>
    </items>
    <items>
      <name>СерверLinux</name>
      <description>Сервер с ОС Linux</description>
    </items>
    <items>
      <name>ТерминальныйСервер</name>
      <description>Терминальный сервер</description>
    </items>
    <items>
      <name>Шлюз</name>
      <description>Шлюз</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьСоздаватьКонтрольныеПроцедуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиLinux</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипОС/ТипОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОС</name>
  <enumValues>
    <name>Windows</name>
  </enumValues>
  <enumValues>
    <name>Linux</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архитектура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияИнформацииОСистеме</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнегоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МакАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистемаВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписи</name>
    <comment>Период записи данных в регистр сведений &quot;Текущие значения производительности&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьДоступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеПроизводительности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОС</name>
    <type>
      <types>EnumRef.ТипОС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРоль</name>
    <type>
      <types>CatalogRef.РолиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСчетчикПоНаименованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеЛицензий1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияRing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаUTCОбновленияЛицензий1С</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СобиратьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Зафиксировать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиОборудования</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиРолей</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/РолиОборудования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Получает оборудование по выбранной роли.
//
// Параметры:
//  Ссылка - СправочникСсылка.РолиОборудования - роль получения оборудования.
//  Все    - Булево                            - если Истина, будут выбраны все, в том числе и
//                                               помеченные на удаление. Значение по умолчанию Ложь.
// Возвращаемое значение:
//  - Массив - массив СправочникСсылка.РабочиеСервера.
//
Функция ПолучитьОборудование(Ссылка, Все = Ложь) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   Оборудование.Ссылка
    |ИЗ
    |   Справочник.Оборудование КАК Оборудование
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование.РолиОборудования КАК РольСервера
    |ПО
    |   РольСервера.Ссылка = Оборудование.Ссылка
    |ГДЕ
    |   РольСервера.Роль = &Роль
    |   {И Оборудование.ПометкаУдаления}
    |УПОРЯДОЧИТЬ ПО
    |   Оборудование.Наименование
    |";
    
    Если Все Тогда
        Запрос.Текст = СтрЗаменить
        (
            Запрос.Текст,
            "{И Оборудование.ПометкаУдаления}",
            ""
        );
    Иначе
        Запрос.Текст = СтрЗаменить
        (
            Запрос.Текст,
            "{И Оборудование.ПометкаУдаления}",
            "И НЕ Оборудование.ПометкаУдаления"
        );
    КонецЕсли;
    
    Запрос.УстановитьПараметр("Роль", Ссылка);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
    Возврат Результат;
    
КонецФункции

// Получает предопределенные счетчики производительности выбранной роли.
//
// Параметры:
//  Ссылка - СправочникСсылка.РолиРабочихСерверов - роль для получения счетчиков производительности. 
//
// Возвращаемое значение:
//  - Массив - массив СправочникСсылка.РабочиеСервера.
//
Функция ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, СчетчикПроизводительностиПрименимо) Экспорт
    
    Счетчики = Справочники.СчетчикиПроизводительности.ПредопределенныеСчетчики(Ссылка, СчетчикПроизводительностиПрименимо);
	
	Возврат Счетчики;
    
КонецФункции

// Получает счетчики производительности выбранных ролей.
//
// Параметры:
//  РолиОборудования - Массив - массив элементов СправочникСсылка.РолиОборудования.
// Возвращаемое значение:
//  - Массив - массив структур с ключами
//             * СчетчикПроизводительности - СправочникСсылка.СчетчикПроизводительности.
//             * РольОборудования - СправочникСсылка.РолиОборудования.
//
Функция ПолучитьСчетчикиПроизводительности(РолиОборудования, Знач ТипОС = Неопределено) Экспорт
    
    Если ТипОС = Неопределено Тогда
        ТипОС = Перечисления.ТипОС.Windows;
    КонецЕсли;
    
    
    Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
    |   РолиОборудованияСчетчикиПроизводительности.СчетчикПроизводительности КАК СчетчикПроизводительности,
    |   РолиОборудованияСчетчикиПроизводительности.Ссылка КАК РольОборудования
	|ИЗ
	|	Справочник.РолиОборудования.СчетчикиПроизводительности%ТипОС% КАК РолиОборудованияСчетчикиПроизводительности
	|ГДЕ
	|	РолиОборудованияСчетчикиПроизводительности.Ссылка В (&РолиОборудования)
	|";
    
    Если ТипОС = Перечисления.ТипОС.Windows Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипОС%", "");
    ИначеЕсли ТипОС = Перечисления.ТипОС.Linux Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипОС%", "Linux");
    КонецЕсли;
    
	Запрос.УстановитьПараметр("РолиОборудования", РолиОборудования);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Счетчики = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Счетчик = Новый Структура("СчетчикПроизводительности, РольОборудования", Выборка.СчетчикПроизводительности, Выборка.РольОборудования);
		Счетчики.Добавить(Счетчик);
	КонецЦикла;
	
	Возврат Счетчики;
    
КонецФункции

#КонецОбласти

#КонецЕсли
